Pada sesi ini, kita telah belajar tentang penggunaan Python untuk berkomunikasi dengan database. Coba teman-teman tuliskan program di Python untuk mengakses table yang ada di database sandbox, pilih dua table yang bisa dilakukan JOIN, satukan dua table tersebut menggunakan perintah SQL, lalu jadikan hasil akhir table tersebut menjadi format excel.

Atau singkatnya:

a. code untuk menghubungkan Python ke database sandbox

b. code sekaligus query SQL untuk menyatukan dua table yang teman-teman pilih

c. code untuk mengubah table menjadi file excel

In [2]:
#code untuk menghubungkan Pythone ke database sandbox
import psycopg2
connection = psycopg2.connect(host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
                              port = 5432,
                              database = "sandbox",
                              user = "group_06",
                              password = "jJwz9KL22x4Prb3LXEJw23HYT")

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [15]:
#code sekaligus query SQL untuk menyatukan dua table yang teman-teman pilih
import pandas as pd
sql = "select first_name, last_name, department_name from sandbox.datasource.employees emp left join sandbox.datasource.departments dept on emp.department_id = dept.department_id"
data = pd.read_sql(sql, con= connection)
data

    first_name last_name   department_name
0       Steven      King         Executive
1        Neena   Kochhar         Executive
2          Lex   De Haan         Executive
3    Alexander    Hunold                IT
4        Bruce     Ernst                IT
..         ...       ...               ...
102        Pat       Fay         Marketing
103      Susan    Mavris   Human Resources
104    Hermann      Baer  Public Relations
105    Shelley   Higgins        Accounting
106    William     Gietz        Accounting

[107 rows x 3 columns]

In [16]:
#code untuk mengubah table menjadi file excel
data.to_excel("data.xlsx",index=False)